tap "anomalyco/tap"
tap "atlassian/acli"
tap "ddev/ddev"
tap "hashicorp/tap"
tap "ngrok/ngrok"
# General-purpose scripting language
brew "php", restart_service: :changed
# Dependency Manager for PHP
brew "composer"
# GitHub command-line tool
brew "gh"
# Tool to manage Dock items from the command line
brew "dockutil"
# Set the default web browser from the command line
brew "defaultbrowser"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Drop-in replacement for MySQL
brew "mariadb@10.6", link: true
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Libraries for security-enabled client and server applications
brew "nss"
# Manage multiple Node.js versions
brew "nvm"
# Fish-like autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell-like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Editor of encrypted files
brew "sops"
# Command-line interface for Vercel
brew "vercel-cli"
# Software to interact with Atlassian Cloud from the terminal
brew "atlassian/acli/acli"
# DDEV
brew "ddev/ddev/ddev"
# Terraform
brew "hashicorp/tap/terraform"
# Password manager that keeps passwords secure
cask "1password", args: { adopt: true }
# Command-line interface for 1Password
cask "1password-cli"
# Terminal-based AI coding assistant
cask "claude-code"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok/ngrok/ngrok"
# Team communication and collaboration software
cask "slack", args: { adopt: true }
# Open-source code editor
cask "visual-studio-code", args: { adopt: true }
# Web browser
cask "google-chrome", args: { adopt: true }
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Collaborative interface design tool
cask "figma", args: { adopt: true }
# Monospace font used as the VS Code editor font
cask "font-inconsolata"
# Customisation software for Logitech mice and keyboards
cask "logitech-options-plus"
