1000ch.svgo
anthropic.claude-code
arcanis.vscode-zipfs
atlassian.atlascode
bradlc.vscode-tailwindcss
burkeholland.simple-react-snippets
christian-kohler.npm-intellisense
dbaeumer.vscode-eslint
docker.docker
eamodio.gitlens
editorconfig.editorconfig
esbenp.prettier-vscode
fabiospampinato.vscode-terminals
formulahendry.auto-rename-tag
github.github-vscode-theme
github.vscode-github-actions
github.vscode-pull-request-github
hashicorp.terraform
ibm.output-colorizer
mechatroner.rainbow-csv
mrmlnc.vscode-apache
ms-azuretools.vscode-azureresourcegroups
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-vscode-remote.remote-containers
ms-vscode.makefile-tools
ms-vsliveshare.vsliveshare
orta.vscode-jest
pnp.polacode
redhat.vscode-xml
redhat.vscode-yaml
richie5um2.vscode-sort-json
simonsiefke.svg-preview
tamasfe.even-better-toml
techer.open-in-browser
unifiedjs.vscode-mdx
vue.volar
wix.glean
wix.vscode-import-cost
